#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/blackboards/infrastructure/runs/run-7DegpDhxikjiYMUx

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...
module.remote_state_bucket.random_id.this: Refreshing state... [id=WvCN]
module.postgres_backups_bucket.random_id.this: Refreshing state... [id=Ze9c]
module.config_bucket.random_id.this: Refreshing state... [id=aPbH]
module.database.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/database-policy]
aws_sns_topic.outages: Refreshing state... [id=arn:aws:sns:eu-west-1:558855412466:outages]
aws_route53_zone.opentracker: Refreshing state... [id=Z03017682LQ8TW5YUFGE0]
aws_iam_user.configuration_deployer: Refreshing state... [id=configuration.deployer]
module.remote_state_bucket.aws_s3_bucket.this: Refreshing state... [id=terraform-remote-state-5af08d]
aws_iam_user.github_actions: Refreshing state... [id=github.actions]
aws_iam_user.postgres_backups: Refreshing state... [id=postgres.backups]
module.secondary.data.aws_iam_policy_document.ec2_assume_role: Refreshing...
aws_iam_user.image_builder: Refreshing state... [id=image.builder]
module.config_bucket.aws_s3_bucket.this: Refreshing state... [id=configuration-68f6c7]
module.secondary.data.aws_iam_policy_document.ec2_assume_role: Refresh complete after 0s [id=2851119427]
aws_iam_user.personal: Refreshing state... [id=alex.jackson]
aws_ecr_repository.uptime: Refreshing state... [id=uptime]
aws_key_pair.main: Refreshing state... [id=macbook-m2-pro]
aws_iam_policy.iac_deployer: Refreshing state... [id=arn:aws:iam::558855412466:policy/iac-deployer-policy]
aws_vpc.main: Refreshing state... [id=vpc-0d1ab7c53aec22955]
data.aws_iam_policy_document.assume_role: Refreshing...
data.aws_iam_policy_document.assume_role: Refresh complete after 0s [id=2690255455]
module.database.data.aws_iam_policy_document.ec2_assume_role: Refreshing...
module.database.data.aws_iam_policy_document.ec2_assume_role: Refresh complete after 0s [id=2851119427]
module.postgres_backups_bucket.aws_s3_bucket.this: Refreshing state... [id=postgres-backups-65ef5c]
module.secondary.aws_iam_role.this: Refreshing state... [id=secondary-role]
aws_iam_access_key.configuration_deployer: Refreshing state... [id=AKIAYEHTA3LZKXOXWTYC]
aws_iam_access_key.image_builder: Refreshing state... [id=AKIAYEHTA3LZI2GLLBWM]
aws_iam_access_key.github_actions: Refreshing state... [id=AKIAYEHTA3LZK6JIHCYE]
aws_iam_role.iac_deployer: Refreshing state... [id=iac-deployer]
aws_iam_access_key.personal: Refreshing state... [id=AKIAYEHTA3LZCH5CBE4Y]
aws_iam_user_login_profile.personal: Refreshing state... [id=alex.jackson]
aws_iam_access_key.postgres_backups: Refreshing state... [id=AKIAYEHTA3LZFDVAEC42]
aws_iam_role.uptime: Refreshing state... [id=uptime]
module.database.aws_iam_role.this: Refreshing state... [id=database-role]
module.secondary.aws_iam_instance_profile.this: Refreshing state... [id=secondary-instance-profile]
aws_iam_role_policy_attachment.iac_deployer: Refreshing state... [id=iac-deployer-20230421061924179000000001]
aws_iam_user_policy.personal: Refreshing state... [id=alex.jackson:alex.jackson.policy]
aws_iam_user_policy.github_actions: Refreshing state... [id=github.actions:github.actions.policy]
module.secondary.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/secondary-policy]
module.database.aws_iam_role_policy_attachment.this: Refreshing state... [id=database-role-20231230120447701700000002]
module.database.aws_iam_instance_profile.this: Refreshing state... [id=database-instance-profile]
aws_sns_topic_subscription.outages: Refreshing state... [id=arn:aws:sns:eu-west-1:558855412466:outages:c15a0919-9e06-484e-bef6-08ab63e662d8]
module.secondary.aws_iam_role_policy_attachment.this: Refreshing state... [id=secondary-role-20231105112810173300000001]
aws_iam_user_policy.image_builder: Refreshing state... [id=image.builder:image.builder.policy]
aws_subnet.main: Refreshing state... [id=subnet-07936cc0e5c7d83b1]
aws_internet_gateway.main: Refreshing state... [id=igw-0aa2c09bec52493fc]
aws_route_table.gateway: Refreshing state... [id=rtb-0881a403738fea9c7]
module.remote_state_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=terraform-remote-state-5af08d]
module.config_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=configuration-68f6c7]
aws_iam_user_policy.configuration_deployer: Refreshing state... [id=configuration.deployer:configuration.deployer.policy]
module.postgres_backups_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=postgres-backups-65ef5c]
aws_iam_user_policy.postgres_backups: Refreshing state... [id=postgres.backups:postgres.backups.policy]
module.secondary.data.aws_subnet.self: Refreshing...
module.database.data.aws_subnet.self: Refreshing...
module.database.aws_ebs_volume.this: Refreshing state... [id=vol-0ac43ea68879b3895]
module.database.aws_security_group.this: Refreshing state... [id=sg-0998f7db6e1ffb7eb]
module.secondary.aws_security_group.this: Refreshing state... [id=sg-06499fd654cd0b866]
aws_route_table_association.gateway: Refreshing state... [id=rtbassoc-041dbac3ebba9c5ca]
module.secondary.data.aws_subnet.self: Refresh complete after 0s [id=subnet-07936cc0e5c7d83b1]
module.database.data.aws_subnet.self: Refresh complete after 0s [id=subnet-07936cc0e5c7d83b1]
module.database.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-1306823711]
module.database.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-1983782041]
module.database.aws_security_group_rule.allow_inbound_postgres: Refreshing state... [id=sgrule-3465932672]
module.database.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-3173870365]
module.database.aws_instance.this: Refreshing state... [id=i-0e48bcc2a0d16252e]
module.secondary.aws_security_group_rule.allow_outbound_subnet_postgres: Refreshing state... [id=sgrule-350438361]
module.secondary.aws_security_group_rule.allow_inbound_https: Refreshing state... [id=sgrule-2531630954]
module.secondary.aws_security_group_rule.allow_inbound_ipv6_https: Refreshing state... [id=sgrule-3593912321]
module.secondary.aws_security_group_rule.allow_outbound_postgres: Refreshing state... [id=sgrule-3245959933]
module.secondary.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-3592804283]
module.secondary.aws_instance.this: Refreshing state... [id=i-0d506cd22642eedac]
module.secondary.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-3873468700]
module.secondary.aws_security_group_rule.allow_inbound_ipv6_ssh: Refreshing state... [id=sgrule-769416183]
module.secondary.aws_security_group_rule.allow_outbound_ssh: Refreshing state... [id=sgrule-978673540]
module.secondary.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-1760375090]
module.database.aws_security_group_rule.allow_inbound_connections_from_instances["sg-06499fd654cd0b866"]: Refreshing state... [id=sgrule-4280258016]
module.database.aws_volume_attachment.this: Refreshing state... [id=vai-3516952077]
module.secondary.aws_eip.this: Refreshing state... [id=eipalloc-004b70de70a6e650a]
aws_route53_record.opentracker_tags: Refreshing state... [id=Z03017682LQ8TW5YUFGE0_tags_A]
aws_route53_record.opentracker: Refreshing state... [id=Z03017682LQ8TW5YUFGE0__A]
aws_iam_role.uptime: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lambda_function.uptime will be created
  + resource "aws_lambda_function" "uptime" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + description                    = "Monitors uptime for a given URI"
      + function_name                  = "uptime"
      + id                             = (known after apply)
      + image_uri                      = "558855412466.dkr.ecr.eu-west-1.amazonaws.com/uptime:20240331-1550"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::558855412466:role/uptime"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>